Repository: BASHEER-A/SafarGet
Catalog: SafarGet/SafarGet Extension/*.lproj/Localizable.strings
Languages: ar

source: Download with SafarGet
ar: تحميل بـ SafarGet

source: Download this file
ar: تحميل هذا الملف

source: Download this video
ar: تحميل هذا الفيديو

source: Download this audio
ar: تحميل هذا الصوت

source: Download this image
ar: تحميل هذه الصورة

source: Download this document
ar: تحميل هذا المستند

source: Download this archive
ar: تحميل هذا الأرشيف

source: Download this executable
ar: تحميل هذا الملف القابل للتنفيذ

source: Download this torrent
ar: تحميل هذا التورنت

source: Download Link
ar: تحميل الرابط

source: Download Image
ar: تحميل الصورة

source: Download Video
ar: تحميل الفيديو

source: Download Audio
ar: تحميل الصوت

source: Download File
ar: تحميل الملف

source: Download All Links
ar: تحميل جميع الروابط

source: Download All Images
ar: تحميل جميع الصور

source: Download All Videos
ar: تحميل جميع الفيديوهات

source: Download started
ar: بدأ التحميل

source: Download added to queue
ar: تم إضافة التحميل إلى القائمة

source: Download failed
ar: فشل التحميل

source: Invalid URL
ar: رابط غير صحيح

source: File not supported
ar: الملف غير مدعوم

source: Network error
ar: خطأ في الشبكة

source: Connection failed
ar: فشل الاتصال

source: SafarGet Download Manager
ar: مدير تحميل SafarGet

source: Fast and reliable download manager for macOS
ar: مدير تحميل سريع وموثوق لـ macOS

source: Download files, videos, and more with ease
ar: حمّل الملفات والفيديوهات والمزيد بسهولة

source: Support for multiple protocols and formats
ar: دعم لعدة بروتوكولات وتنسيقات

source: Advanced download management features
ar: ميزات إدارة التحميل المتقدمة

source: Permission Required
ar: مطلوب إذن

source: SafarGet needs permission to download files
ar: SafarGet يحتاج إذن لتحميل الملفات

source: Please allow access in Safari settings
ar: يرجى السماح بالوصول في إعدادات Safari

source: Go to Safari Settings
ar: الذهاب إلى إعدادات Safari

source: Extension Settings
ar: إعدادات الإضافة

source: Enable Extension
ar: تفعيل الإضافة

source: Disable Extension
ar: إلغاء تفعيل الإضافة

source: Video Files
ar: ملفات الفيديو

source: Audio Files
ar: ملفات الصوت

source: Image Files
ar: ملفات الصور

source: Document Files
ar: ملفات المستندات

source: Archive Files
ar: ملفات الأرشيف

source: Executable Files
ar: ملفات قابلة للتنفيذ

source: Torrent Files
ar: ملفات التورنت

source: All Files
ar: جميع الملفات

source: Best Quality
ar: أفضل جودة

source: High Quality
ar: جودة عالية

source: Medium Quality
ar: جودة متوسطة

source: Low Quality
ar: جودة منخفضة

source: Audio Only
ar: صوت فقط

source: Video Only
ar: فيديو فقط

source: Auto Select
ar: اختيار تلقائي

source: Download to Downloads folder
ar: تحميل إلى مجلد التحميلات

source: Download to custom location
ar: تحميل إلى موقع مخصص

source: Ask for location each time
ar: اسأل عن الموقع في كل مرة

source: Use default settings
ar: استخدم الإعدادات الافتراضية

source: Show download progress
ar: إظهار تقدم التحميل

source: Start download immediately
ar: ابدأ التحميل فوراً

source: Add to queue
ar: إضافة إلى القائمة

source: Extension not available
ar: الإضافة غير متاحة

source: Please install SafarGet app
ar: يرجى تثبيت تطبيق SafarGet

source: App not running
ar: التطبيق لا يعمل

source: Please start SafarGet app
ar: يرجى تشغيل تطبيق SafarGet

source: Connection to app failed
ar: فشل الاتصال بالتطبيق

source: Please check app status
ar: يرجى فحص حالة التطبيق

source: Download limit reached
ar: تم الوصول إلى حد التحميل

source: Please wait for current downloads
ar: يرجى الانتظار للتحميلات الحالية

source: Download added successfully
ar: تم إضافة التحميل بنجاح

source: File will be downloaded
ar: سيتم تحميل الملف

source: Check SafarGet app for progress
ar: تحقق من تطبيق SafarGet للتقدم

source: Download completed
ar: اكتمل التحميل

source: File saved successfully
ar: تم حفظ الملف بنجاح

source: Ready for download
ar: جاهز للتحميل

source: Download queued
ar: التحميل في القائمة

source: General
ar: عام

source: Downloads
ar: التحميلات

source: File Types
ar: أنواع الملفات

source: Quality
ar: الجودة

source: Location
ar: الموقع

source: Behavior
ar: السلوك

source: Notifications
ar: الإشعارات

source: Advanced
ar: متقدم

source: Show in context menu
ar: إظهار في قائمة السياق

source: Download options
ar: خيارات التحميل

source: Quick download
ar: تحميل سريع

source: Download with options
ar: تحميل مع خيارات

source: Always ask for options
ar: اسأل دائماً عن الخيارات

source: Download paused
ar: توقف التحميل مؤقتاً

source: Download resumed
ar: استؤنف التحميل

source: Download stopped
ar: توقف التحميل

source: All downloads completed
ar: اكتملت جميع التحميلات

source: Download queue empty
ar: قائمة التحميل فارغة
